DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
uint8_t readBootRecoveryCounter() {
  EEPROM.begin(kEepromBytes);
  uint32_t magic = 0;
  EEPROM.get(kBootRecoveryOffset, magic);
  if (magic != kBootRecoveryMagic) {
    return 0;
  }
  return EEPROM.read(kBootRecoveryOffset + 4);
}

void writeBootRecoveryCounter(uint8_t counter) {
  EEPROM.begin(kEepromBytes);
  EEPROM.put(kBootRecoveryOffset, kBootRecoveryMagic);
  EEPROM.write(kBootRecoveryOffset + 4, counter);
  EEPROM.commit();
}

void clearBootRecoveryCounter() {
  EEPROM.begin(kEepromBytes);
  for (size_t i = 0; i < kBootRecoveryBytes; ++i) {
    EEPROM.write(kBootRecoveryOffset + i, 0);
  }
  EEPROM.commit();
  bootRecoveryCounterNeedsClear = false;
  Serial.println("boot_recovery_counter_cleared");
}

bool consumeBootRecoveryTrigger() {
  uint8_t counter = readBootRecoveryCounter();
  if (counter < 255) {
    ++counter;
  }
  writeBootRecoveryCounter(counter);
  Serial.printf("boot_recovery_counter value=%u threshold=%u\n", counter, kBootRecoveryThreshold);

  if (counter >= kBootRecoveryThreshold) {
    clearWifiCredentials();
    clearBootRecoveryCounter();
    Serial.println("boot_recovery_triggered action=wifi_setup");
    drawWifiResetStatus("Starting setup");
    delay(1000);
    return true;
  }

  bootRecoveryCounterNeedsClear = true;
  bootRecoveryClearAtMs = millis() + kBootRecoveryStableMs;
  return false;
}

bool connectToSavedWifi(const WifiCredentials& creds) {
  Serial.printf("wifi_connect ssid=%s\n", creds.ssid);
  drawWifiConnectingStatus(creds.ssid);
  WiFi.mode(WIFI_STA);
  WiFi.begin(creds.ssid, creds.password);

  const unsigned long startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - startedAt) < kWifiConnectTimeoutMs) {
    delay(250);
    Serial.print(".");
  }
  Serial.println();

  if (WiFi.status() != WL_CONNECTED) {
    Serial.printf("wifi_connect_failed status=%d\n", static_cast<int>(WiFi.status()));
    return false;
  }

  Serial.printf("wifi_connected ssid=%s ip=%s\n", creds.ssid, WiFi.localIP().toString().c_str());
  drawWaitingForCompanionStatus();
  return true;
}

bool connectToSdkWifiConfig() {
  WiFi.mode(WIFI_STA);
  const String ssid = WiFi.SSID();
  if (ssid.length() == 0) {
    Serial.println("wifi_sdk_config_missing");
    return false;
  }

  Serial.printf("wifi_sdk_connect ssid=%s\n", ssid.c_str());
  drawWifiConnectingStatus(ssid);
  WiFi.begin();

  const unsigned long startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - startedAt) < kWifiConnectTimeoutMs) {
    delay(250);
    Serial.print(".");
  }
  Serial.println();

  if (WiFi.status() != WL_CONNECTED) {
    Serial.printf("wifi_sdk_connect_failed status=%d\n", static_cast<int>(WiFi.status()));
    return false;
  }

  const String password = WiFi.psk();
  if (ssid.length() < kWifiSsidBytes && password.length() < kWifiPasswordBytes) {
    saveWifiCredentials(ssid, password);
    Serial.printf("wifi_sdk_credentials_imported ssid=%s\n", ssid.c_str());
  }

  Serial.printf("wifi_connected source=sdk ssid=%s ip=%s\n", ssid.c_str(), WiFi.localIP().toString().c_str());
  drawWaitingForCompanionStatus();
  return true;
}

void scanSetupNetworks() {
  String options;
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  delay(150);
  const int networks = WiFi.scanNetworks();
  for (int i = 0; i < networks; ++i) {
    const String ssid = WiFi.SSID(i);
    if (ssid.length() == 0) {
      continue;
    }
    options += "<option value=\"";
    options += htmlEscape(ssid);
    options += "\">";
    options += htmlEscape(ssid);
    options += " (";
    options += String(WiFi.RSSI(i));
    options += " dBm)</option>";
  }
  WiFi.scanDelete();
  setupWifiOptionsHTML = options;
  Serial.printf("wifi_setup_scan networks=%d options=%u\n", networks, setupWifiOptionsHTML.length());
}

String setupPageHTML() {
  String html;
  html.reserve(1600);
  html += "<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>";
  html += "<title>VibeTV Setup</title><style>";
  html += "body{font-family:-apple-system,BlinkMacSystemFont,Segoe UI,sans-serif;margin:0;background:#101113;color:#f7f7f2}";
  html += "main{max-width:460px;margin:0 auto;padding:32px 20px}label{display:block;margin:18px 0 6px}";
  html += "select,input,button{box-sizing:border-box;width:100%;font:inherit;padding:12px;border-radius:8px;border:1px solid #555;background:#181a1d;color:#fff}";
  html += "button{margin-top:22px;background:#c7ff00;color:#111;border:0;font-weight:700}.muted{color:#aaa;line-height:1.4}";
  html += "</style></head><body><main><h1>VibeTV Setup</h1>";
  html += "<p class='muted'>Choose your home WiFi and save the connection. Vibe TV restarts after saving.</p>";
  html += "<form method='post' action='/save'><label>Choose WiFi</label><select name='ssid'>";
  html += setupWifiOptionsHTML.length() > 0 ? setupWifiOptionsHTML : "<option value=''>No networks found</option>";
  html += "</select><label>Enter SSID manually</label><input name='custom_ssid' maxlength='32' autocomplete='off' placeholder='WiFi name'>";
  html += "<label>Password</label><input name='password' type='password' maxlength='64' autocomplete='current-password'>";
  html += "<button type='submit'>Save</button></form>";
  html += "<p class='muted'>Setup address: http://";
  html += kSetupHost;
  html += "<br>Fallback: http://192.168.4.1</p></main></body></html>";
  return html;
}

String connectedPageHTML() {
  const String ip = WiFi.localIP().toString();
  const bool hasFrame = codexbar_display::app::HasFrame(runtimeCtx);
  String setupCommand;
  setupCommand.reserve(120);
  setupCommand += "curl -fsSL https://github.com/DreamyTalesPAN/CodexBar-Display/releases/latest/download/install.sh | bash";

  String html;
  html.reserve(6600);
  html += "<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>";
  html += "<title>VibeTV Setup</title><style>";
  html += ":root{color-scheme:dark;--bg:#0b0c0d;--panel:#15171a;--line:#2b2f35;--text:#f6f4ed;--muted:#a9adb3;--signal:#c7ff00}";
  html += "*{box-sizing:border-box}body{font-family:-apple-system,BlinkMacSystemFont,Segoe UI,sans-serif;margin:0;background:var(--bg);color:var(--text)}";
  html += "main{max-width:640px;margin:0 auto;padding:28px 20px 34px}.device{border:1px solid var(--line);border-radius:8px;background:#101214;padding:14px;margin-bottom:28px}";
  html += ".device-head{display:flex;justify-content:space-between;gap:12px;align-items:center;margin-bottom:12px}.brand{font-weight:900;letter-spacing:0}.pill{border:1px solid #314100;color:var(--signal);padding:6px 10px;border-radius:999px;font-size:13px;font-weight:800}";
  html += ".device-grid{display:grid;grid-template-columns:1fr 1fr;gap:10px}.device-item{border-top:1px solid #252a30;padding-top:10px}.label{display:block;color:var(--muted);font-size:12px;font-weight:800;text-transform:uppercase}";
  html += "h1{font-size:40px;line-height:1.02;margin:0 0 12px;letter-spacing:0}.lead{font-size:18px;line-height:1.45;margin:0 0 24px;color:#d8d8d2}";
  html += ".update{border:1px solid #6f8f00;background:#1b2400;color:#f1ffd0;border-radius:8px;padding:12px;margin-top:12px}.update strong{display:block;color:var(--signal);margin-bottom:4px}.update span{display:block;color:#f1ffd0;line-height:1.45}.update-link{display:inline-block;margin-top:8px;color:var(--signal);font-weight:900}";
  html += "code,pre{font-family:ui-monospace,SFMono-Regular,Menlo,Consolas,monospace}code{color:#fff}pre{white-space:pre-wrap;word-break:break-word;background:#08090a;border:1px solid #30343a;border-radius:8px;margin:0 0 14px;padding:14px;color:#fff;line-height:1.25}";
  html += "button{font:inherit}.primary{width:100%;min-height:48px;border:0;border-radius:8px;background:var(--signal);color:#111;font-weight:900;cursor:pointer}";
  html += ".steps{display:grid;gap:14px;margin:22px 0 0}.step{border-top:1px solid #30343a;padding-top:14px;color:#d8d8d2;line-height:1.45}.step-title{display:block;color:#fff;font-weight:900;margin-bottom:8px}.num{color:var(--signal);font-weight:900;margin-right:6px}";
  html += ".tools{display:flex;flex-wrap:wrap;gap:12px;margin-top:18px;align-items:center}.tools form{margin:0}.tools a,.reset{color:var(--muted);background:transparent;border:0;padding:0;text-decoration:underline;text-underline-offset:3px;font:inherit;cursor:pointer}.tools a:hover,.reset:hover{color:var(--signal)}";
  html += ".note{margin:18px 0 0;color:var(--muted);font-size:14px;line-height:1.45}@media(max-width:560px){main{padding-top:22px}.device-head{display:block}.pill{display:inline-block;margin-top:10px}h1{font-size:34px}.device-grid{grid-template-columns:1fr}}</style></head><body><main>";
  html += "<section class='device' aria-label='Vibe TV status'><div class='device-head'><div class='brand'>Vibe TV</div><div class='pill'>Connected</div></div><div class='device-grid'><div class='device-item'><span class='label'>Vibe TV address</span><code>http://";
  html += kMdnsHost;
  html += "</code></div><div class='device-item'><span class='label'>Fallback IP</span><code>http://";
  html += ip;
  html += "</code></div></div>";
  html += updateStatusHTML(true);
  html += "</section>";
  if (hasFrame) {
    html += "<h1>Vibe TV is live.</h1>";
    html += "<p class='lead'>Your Mac is sending workflow signals. Keep this page for device status, firmware updates, or WiFi reset.</p>";
  } else {
    html += "<h1>Finish Mac setup.</h1>";
    html += "<p class='lead'>Follow these three steps to connect this Mac to Vibe TV.</p>";
    html += "<section class='steps' aria-label='Mac setup steps'><div class='step'><span class='step-title'><span class='num'>01</span>Copy command</span><pre id='cmd'>";
    html += htmlEscape(setupCommand);
    html += "</pre><textarea id='cmdFallback' readonly style='position:absolute;left:-9999px'></textarea>";
    html += "<button class='primary' type='button' onclick='copyCmd()' id='copyBtn'>Copy setup command</button></div>";
    html += "<div class='step'><span class='step-title'><span class='num'>02</span>Paste in Terminal</span>Open Terminal on your Mac, paste the command, and press Enter.</div>";
    html += "<div class='step'><span class='step-title'><span class='num'>03</span>Wait for live signals</span>When the Mac app starts sending frames, this page changes to the live status view.</div></section>";
  }
  html += "<div class='tools'><a href='/health'>Device status</a><a href='/update'>Firmware update</a>";
  html += "<form method='post' action='/reset-wifi' onsubmit=\"return confirm('Clear WiFi settings and restart setup?')\">";
  html += "<button class='reset' type='submit'>Reset WiFi</button></form></div>";
  html += "<script>function copied(){document.getElementById('copyBtn').textContent='Copied';}";
  html += "function fallbackCopy(t){var a=document.getElementById('cmdFallback');a.value=t;a.focus();a.select();try{document.execCommand('copy');copied();}catch(e){window.prompt('Copy this command',t);}}";
  html += "function copyCmd(){var t=document.getElementById('cmd').textContent.trim();if(navigator.clipboard&&navigator.clipboard.writeText){navigator.clipboard.writeText(t).then(copied,function(){fallbackCopy(t);});}else{fallbackCopy(t);}}</script>";
  html += "</body></html>";
  return html;
}

void handleRoot() {
  if (setupMode) {
    webServer.send(200, "text/html; charset=utf-8", setupPageHTML());
    return;
  }
  webServer.send(200, "text/html; charset=utf-8", connectedPageHTML());
}

void redirectToSetupRoot() {
  webServer.sendHeader("Location", String("http://") + kSetupHost + "/", true);
  webServer.send(302, "text/plain; charset=utf-8", "");
}

